# Напишите программу, которая приветствует пользователя,
# выводя слово Hello, введенное имя и знаки препинания по образцу: Hello Kitty!

N = input('Enter your name: ')

print('Hello, {}!'.format(N))
